Тест/Тест/src/InformationRegisters/ИндНомер/ИндНомер.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИндНомер</name>
  <resources>
    <name>Код</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>наценка</name>
    <type>
      <types>CatalogRef.Коофициенты</types>
    </type>
  </resources>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>цп</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>дн</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>п</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>АвитоЧастник</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЭтоНовыйИндКод</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>Стеллаж</name>
    <type>
      <types>CatalogRef.Стеллаж</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаПроверена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Модель</name>
    <type>
      <types>CatalogRef.МоделиАвтомобилей</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзмененияКонвеера</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьФото</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.Состояние</types>
    </type>
  </attributes>
  <attributes>
    <name>Поддон</name>
    <type>
      <types>CatalogRef.Поддоны</types>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатураДляПоиска</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>18</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подкатегория</name>
    <type>
      <types>CatalogRef.Категории</types>
    </type>
  </attributes>
  <attributes>
    <name>КлючевыеСлова</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНаличия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ФактНаличия</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЗаНаличие</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Машина</name>
    <type>
      <types>CatalogRef.Машины</types>
    </type>
  </attributes>
  <attributes>
    <name>ДетальКлиента</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Оценка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроверкиЕстьВНаличии</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЕстьВНаличии</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВАвтозагрузкеАвито</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>индкод</name>
    <type>
      <types>CatalogRef.ИндКод</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Тест/Тест/src/AccumulationRegisters/РегистрНакопления1/РегистрНакопления1.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РегистрНакопления1</name>
  <resources>
    <name>Колво</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Товар</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>машина</name>
    <type>
      <types>CatalogRef.Машины</types>
    </type>
  </dimensions>
  <dimensions>
    <name>индкод</name>
    <type>
      <types>CatalogRef.ИндКод</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Тест/Тест/src/InformationRegisters/ИндНомер/RecordSetModule.bsl
Процедура ПередЗаписью(Отказ, Замещение)
/// Комлев 02/09/24 +++

//	Если ОбменДанными.Загрузка Тогда
//		Возврат;
//	КонецЕсли;
//// ++ МазинЕС Если из ячейки РВР перенести деталь на ячейку НЕ РВР то деталь удалится из ЗакзНаряда
//	Для Каждого Стр Из ЭтотОбъект Цикл
//		
//		Если СтрНайти(Строка(Стр.Стеллаж), "yachejka RVR") = 0 И СтрНайти(Строка(Стр.Стеллаж), "Сервисные услуги") = 0 Тогда
//				
//				ЗапросПоПартии = Новый Запрос;
//				ЗапросПоПартии.Текст =
//				"ВЫБРАТЬ
//				|	ЗаказНарядТовары.Ссылка
//				|ИЗ
//				|	Документ.ЗаказНаряд.Товары КАК ЗаказНарядТовары
//				|ГДЕ
//				|	ЗаказНарядТовары.Партия = &Партия";
//
//				ЗапросПоПартии.УстановитьПараметр("Партия", Стр.индкод);
//				РезультатЗапроса = ЗапросПоПартии.Выполнить();
//				Если НЕ РезультатЗапроса.Пустой() Тогда
//					
//					Выборка = РезультатЗапроса.Выбрать();
//					Выборка.Следующий();
//					ЗаказНарядОбъект = Выборка.Ссылка.ПолучитьОбъект();
//					НайденнаяСтрока = ЗаказНарядОбъект.Товары.Найти(Стр.индкод, "Партия");
//					
//					Если НайденнаяСтрока <> Неопределено тогда 
//						
//						НайденнаяСтрока.Партия 		= Справочники.ИндКод.ПустаяСсылка(); 
//						НайденнаяСтрока.Состояние		= Перечисления.СтатусыТовараВЗаказНаряде.Планово; // "Ожидание" для WT10 | "Планово" для приложение склад
//						
//						НайденнаяСтрока.Склад	 =	Справочники.Склады.ПустаяСсылка();   
//						НайденнаяСтрока.Автомобиль = Справочники.Машины.ПустаяСсылка();
//						
//						ЗаказНарядОбъект.Записать(РежимЗаписиДокумента.Проведение); 
//						Возврат;
//					КонецЕсли;
//				КонецЕсли; 
//			КонецЕсли;
//	КонецЦикла;
//
//// -- МазинЕС Если из ячейки РВР перенести деталь на ячейку НЕ РВР то деталь удалится из ЗакзНаряда
//
//	Для Каждого Стр Из ЭтотОбъект Цикл
//// При записи Регистра Сведений проверяется стеллаж, Если это ячейка РВР тогда в Заказ наряде в тч Товары меняется статус с "Планово" на "Собрано"
//			Попытка
//				Если СтрНайти(Строка(Стр.Стеллаж), "yachejka RVR") <> 0 ИЛИ СтрНайти(Строка(Стр.Стеллаж), "Сервисные услуги") <> 0 Тогда 
//	// Сначала ищещем Заказ наряд по Партии в тч
//					ЗапросПоПартии = Новый Запрос;
//					ЗапросПоПартии.Текст =
//					"ВЫБРАТЬ
//					|	ЗаказНарядТовары.Ссылка
//					|ИЗ
//					|	Документ.ЗаказНаряд.Товары КАК ЗаказНарядТовары
//					|ГДЕ
//					|	ЗаказНарядТовары.Партия = &Партия";
//	
//					ЗапросПоПартии.УстановитьПараметр("Партия", Стр.индкод);
//	
//				//@skip-check query-in-loop
//					РезультатЗапроса = ЗапросПоПартии.Выполнить();
//						
//					Если РезультатЗапроса.Пустой() Тогда
//	// Если не нашли по Партии, ищем по Номенклатуре
//						ЗапросПоНоменклатуре = Новый Запрос;
//						ЗапросПоНоменклатуре.Текст =
//						"ВЫБРАТЬ
//						|	ЗаказНарядТовары.Ссылка КАК Ссылка
//						|ИЗ
//						|	Документ.ЗаказНаряд.Товары КАК ЗаказНарядТовары
//						|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказНаряд КАК ЗаказНаряд
//						|		ПО (ЗаказНарядТовары.Ссылка = ЗаказНаряд.Ссылка)
//						|ГДЕ
//						|	ЗаказНарядТовары.Номенклатура = &Номенклатура
//						|	И ЗаказНаряд.ЯчейкаРВР = &ЯчейкаРВР";
//	
//						ЗапросПоНоменклатуре.УстановитьПараметр("Номенклатура", Стр.индкод.Владелец);
//						ЗапросПоНоменклатуре.УстановитьПараметр("ЯчейкаРВР", Стр.Стеллаж);
//						
//						РезультатЗапроса = ЗапросПоНоменклатуре.Выполнить();
//	
//						Выборка = РезультатЗапроса.Выбрать();
//	
//						Пока	Выборка.Следующий() Цикл
//									ЗаказНарядОбъект = Выборка.Ссылка.ПолучитьОбъект();
//									//НайденнаяСтрока = ЗаказНарядОбъект.Товары.НайтиСтроки(Стр.индкод.Владелец, "Номенклатура");				
//										Для Каждого Строка ИЗ   ЗаказНарядОбъект.Товары Цикл 
//											Если  Строка.Номенклатура = Стр.индкод.Владелец Тогда
//												 Если Строка.Состояние = Перечисления.СтатусыТовараВЗаказНаряде.Планово
//													Или Строка.Состояние = Перечисления.СтатусыТовараВЗаказНаряде.ПустаяСсылка()
//													или Строка.Состояние = Перечисления.СтатусыТовараВЗаказНаряде.Срочно
//													или Строка.Состояние = Перечисления.СтатусыТовараВЗаказНаряде.Ожидание 
//													или Строка.Состояние = Перечисления.СтатусыТовараВЗаказНаряде.Заказано Тогда   // "Ожидание" для WT10 | "Планово" для приложение склад
//													// Меняем Статус в строке ТЧ На "Собрано" 
//													Строка.Состояние		= Перечисления.СтатусыТовараВЗаказНаряде.Собрано;
//													Строка.Партия			= Стр.индкод;
//													Строка.Цена				= Стр.Цена; 
//													Стуктура 				= ЗаполнитьАвтомобильНаСервере(Стр.индкод);
//													Строка.Автомобиль		= Стуктура.Машина; 
//													Строка.Склад			= Стуктура.Склад; 
//													ЗаказНарядОбъект.Записать(РежимЗаписиДокумента.Проведение);
//													Возврат;  
//												 КонецЕсли; 
//											КонецЕсли;
//										КонецЦикла; 
//						КонецЦикла; 									
//					// Если нашли заказ по Партии в ТЧ, то дальше не ищем
//					Иначе
//	
//						Выборка = РезультатЗапроса.Выбрать();
//	
//						Выборка.Следующий();
//						ЗаказНарядОбъект = Выборка.Ссылка.ПолучитьОбъект();
//						НайденнаяСтрока = ЗаказНарядОбъект.Товары.Найти(Стр.индкод, "Партия");
//						Если НайденнаяСтрока <> Неопределено Тогда
//							Если НайденнаяСтрока.Состояние = Перечисления.СтатусыТовараВЗаказНаряде.Планово
//								Или НайденнаяСтрока.Состояние = Перечисления.СтатусыТовараВЗаказНаряде.ПустаяСсылка() 
//								или НайденнаяСтрока.Состояние = Перечисления.СтатусыТовараВЗаказНаряде.Срочно
//								или НайденнаяСтрока.Состояние = Перечисления.СтатусыТовараВЗаказНаряде.Ожидание
//								или Строка.Состояние = Перечисления.СтатусыТовараВЗаказНаряде.Заказано Тогда   // "Ожидание" для WT10 | "Планово" для приложение склад
//	// Меняем Статус в строке ТЧ На "Собрано"
//								НайденнаяСтрока.Состояние = Перечисления.СтатусыТовараВЗаказНаряде.Собрано;
//								НайденнаяСтрока.Цена	=  Стр.Цена; 
//								ЗаказНарядОбъект.Записать(РежимЗаписиДокумента.Проведение);
//								Возврат;
//							КонецЕсли;
//	
//						КонецЕсли;
//					КонецЕсли;
//					//Отказ = Истина;
//				КонецЕсли;
//			Исключение
//				п = Истина;
//			КонецПопытки;	
//	КонецЦикла;
/// Комлев 02/09/24 ---
КонецПроцедуры

Функция ЗаполнитьАвтомобильНаСервере(Партия)
	
	Структура = новый Структура();	
	
	Запрос = Новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	РегистрНакопления1Остатки.машина КАК Машина,
	|	РегистрНакопления1Остатки.Склад КАК Склад
	|ИЗ
	|	РегистрНакопления.РегистрНакопления1.Остатки(, индкод = &Партия) КАК РегистрНакопления1Остатки";
	Запрос.УстановитьПараметр("Партия",Партия);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	Структура.Вставить("Машина",Выборка.Машина);
	Структура.Вставить("Склад",Выборка.Склад);
	Возврат Структура;
КонецФункции


//Процедура ПриЗаписи(Отказ, Замещение)
//	Если ОбменДанными.Загрузка Тогда
//		Возврат;
//	КонецЕсли;
//	// +++ Меняем ЭтапПродажи заказКлиента	
//Для Каждого Стр Из ЭтотОбъект Цикл
//	Если СтрНайти(Строка(Стр.Стеллаж), "Korzina") <> 0 ТОгда
//			Запрос = Новый Запрос;
//			Запрос.Текст = 
//				"ВЫБРАТЬ
//				|	ЗаказКлиентаТовары.Ссылка КАК Ссылка
//				|ИЗ
//				|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
//				|ГДЕ
//				|	ЗаказКлиентаТовары.Партия = &Партия";  
//			
//			Запрос.УстановитьПараметр("Партия", Стр.индкод);
//			
//			РезультатЗапроса = Запрос.Выполнить();
//			
//			Выборка = РезультатЗапроса.Выбрать();
//			
//			Пока Выборка.Следующий() Цикл
//			
//				Попытка
//					ЗаказКлиента = 	Выборка.Ссылка.ПолучитьОбъект(); 
//					ЗаказКлиента.Записать(РежимЗаписиДокумента.Проведение); 
//				Исключение 
//					Сообщение = Новый СообщениеПользователю();
//					Сообщение.Текст = "Ошибка!!! не получилось синхронизовать заявку. Пишите в тех поддержку! Код ошибки Инд432"; 
//					Сообщение.Сообщить();
//				КонецПопытки;
//			КонецЦикла;	
//	Иначе 
//			Запрос = Новый Запрос;
//			Запрос.Текст = 
//				"ВЫБРАТЬ
//				|	ЗаказКлиентаТовары.Ссылка КАК Ссылка
//				|ИЗ
//				|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
//				|ГДЕ
//				|	ЗаказКлиентаТовары.Партия = &Партия";  
//			
//			Запрос.УстановитьПараметр("Партия", Стр.индкод);
//			
//			РезультатЗапроса = Запрос.Выполнить();
//			
//			Выборка = РезультатЗапроса.Выбрать();
//			
//			Пока Выборка.Следующий() Цикл
//			
//				Попытка
//					ЗаказКлиента = 	Выборка.Ссылка.ПолучитьОбъект(); 
//					ЗаказКлиента.Записать(РежимЗаписиДокумента.Проведение); 
//				Исключение 
//					Сообщение = Новый СообщениеПользователю();
//					Сообщение.Текст = "Ошибка!!! не получилось синхронизовать заявку. Пишите в тех поддержку! Код ошибки Инд433"; 
//					Сообщение.Сообщить();
//				КонецПопытки;
//			КонецЦикла;	
//		
//	КонецЕСли;
//КонецЦикла;
//		// +++ Меняем ЭтапПродажи заказКлиента
//КонецПроцедуры
